Repository: wp-plugins/elfinder
Catalog: language/elfinder-*.po
Languages: ru_ru

source: elFinder Settings
ru_ru: Настройки elFinder

source: Settings saved.
ru_ru: Настройки сохранены.

source: Path to root directory
ru_ru: Путь к корневой директории

source: Root directory URL
ru_ru: URL корневой директории

source: Alias
ru_ru: Алиас

source: Display this instead of root directory name.
ru_ru: Отображается вместо названия корневой директории.

source: List of not allowed commands
ru_ru: Список отключенных команд

source: Divided by commas &mdash; here and below.
ru_ru: Разделяя элеметы списка запятыми &mdash; здесь и далее.

source: Display dot files
ru_ru: Показывать .файлы

source: Count total directories sizes
ru_ru: Подсчитывать размер директорий

source: New files mode
ru_ru: Права доступа к новым файлам

source: New folders mode
ru_ru: Права доступа к новым папкам

source: MIME-type detection method
ru_ru: Способ определения mime-типов файлов

source: internal (based on file extensions)
ru_ru: internal (по расширению)

source: auto detect
ru_ru: автоопределение

source: List of mime-types allowed to upload
ru_ru: Список типов файлов, разрешенных для загрузки

source: Can be set exactly <b>image/jpeg</b> or to group <b>application</b>.
ru_ru: Возможно задание точного mimetype ( <b>image/jpeg</b>) или группы типов ( <b>application</b>).

source: Order of upload rules execution
ru_ru: Порядок применения правил загрузки файлов

source: Deny,allow &mdash; what is not disallowed or allowed (OR).
ru_ru: Deny,allow &mdash; то, что не запрещено или разрешено (OR).

source: Allow,deny &mdash; only what is allowed, except what is disallowed (AND).
ru_ru: Allow,deny &mdash; только то, что разрешено, кроме того, что запрещено (AND).

source: Library for thumbnail creation
ru_ru: Библиотека для создания иконок изображений

source: try detect automatically
ru_ru: определить автоматически

source: Directory name for image thumbnails
ru_ru: Название папки с иконками изображений

source: Leave the field blank to avoid thumbnails generation.
ru_ru: Оставьте поле пустым, чтобы не использовать предпросмотр изображений.

source: How often to clean thumbnails
ru_ru: Частота очистки директории с превьюшками

source: Possible values: from 0 to 200. 0 &mdash; never, 200 &mdash; on each client init request.
ru_ru: Возможные значения &mdash; от 0 до 200. 0 &mdash; не очищать, 200 &mdash; при каждом запросе инициализации файлового менеджера

source: How many thumbnails to create per background request
ru_ru: Сколько миниатюрок создавать за один фоновый запрос

source: Thumbnail size
ru_ru: Размер миниатюрок

source: pixels
ru_ru: пикселей

source: Show real URLs to files in client
ru_ru: Показывать URL файлов клиенту

source: File modification date format
ru_ru: Формат даты последнего изменения файла

source: Object logger
ru_ru: Объект-логгер

source: Default access for files/directories
ru_ru: Права доступа к файлам/директориям по умолчанию

source: Individual folders/files permisions
ru_ru: Права доступа к индивидуальным файлам/директориям

source: Add
ru_ru: Добавить

source: Remove
ru_ru: Удалить

source: disallow delete jpeg/png/gif
ru_ru: запретить удаление jpeg/png/gif

source: disallow write to text files (also you won't be able to rename them)
ru_ru: запретить запись в текстовые файлы (так же их нельзя будет их переименовать)

source: «default access..» is set to «read» only &rarr; read &mdash; all, write and delete only in personal directory
ru_ru: «права по умолчанию» выставлены в значение «только чтение» &rarr; чтение &mdash; всё, запись и удаление разрешены только в директории пользователя

source: Send debug information to client
ru_ru: Отсылать отладочную информацию клиенту

source: List of file archives allowed to create
ru_ru: Список типов архивов, разрешенных для создания

source: If not set will allow all detected archvies.
ru_ru: Если не задан &mdash; будут разрешены все доступные типы

source: Info about archivers to use
ru_ru: Информация об архиваторах

source: Leave the fields blank for auto detect.
ru_ru: Оставьте поля пустыми, и коннектор попытается найти и использовать все доступные архиваторы.
